# Task 7

"""
Реализовать генератор с помощью функции с ключевым словом yield,
создающим очередное значение. При вызове функции должен создаваться
объект-генератор. Функция должна вызываться следующим образом:
for el in fact(n). Функция отвечает за получение факториала числа,
а в цикле необходимо выводить только первые n чисел, начиная с 1! и до n!.
"""

from math import factorial


def fact(n):
    yield [factorial(i) for i in range(1, n + 1)]


for el in fact(8):
    print(el)
