# Task 6
"""
Реализовать два небольших скрипта:
а) итератор, генерирующий целые числа, начиная с указанного,
б) итератор, повторяющий элементы некоторого списка, определенного заранее.
"""

import my_scripts as ms

print(ms.int_numbers(11, 150, 7))
print(ms.round_list(['комната', 'шкаф', 'дверь', 'холодильник'], 9))
